#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "12be6fe918952b2470803df4db8acbd9" -> "513d50e0d37426792a521418e76670c1"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6357ebedd1c9ec8ea9741b9efc5c66ba" -> "6005f994b40625b5808d5f28175655c3"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "253d4719f63a488f56604e7c2a77a743" -> "081227fd77e9faf1c9f1daf3d3acb99b"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "cef5c5ce64919cfe5d1f9967a2530d54" -> "333f2218b9e53b1bd3f2c74162d2463d"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "89698d94850f871ca1d4142fe9efda01" -> "2cfb432755322a42c8599938135c0f80"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "b8e3ff781db1973eaa4ea6cea036dfb5" -> "60e15afd7cb833c48c51da4727466cdc"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "0ecd55e418614ebe164dc3b9ca4be98e" -> "a81028cc373f27787e3329ac8c40c0af"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b818557f807f60408f2ff022c3b5ae63" -> "d37f8939615111efdc3e311db591e188"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "d8c7786860fa7cbb22890f3a0d1696b9" -> "16abde743ff5381005db6a12451313a9"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "42cb98ebcbb5390f3b73d3fadd7a1b49" -> "6338b5300a2ac29285ff898307b137b1"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "69cdd35d4a8c962ca98b71c7dc30b953" -> "c204fe20ee68b07937f0107c7c4927e5"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8149826ac93f56855ee25f3b806adad5" -> "7460823bf10c1ab58107fd3d7dda85d2"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "6e49c98c7364c5efbee60b882a6c5f50" -> "69d8b76f403d66f099de962d661e81bb"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b923e18455190f82e0e2c930f0b443d1" -> "2fef28341f5d6ad01b03c7c1cdae418f"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "251e95486f1f4fee9be2b26e908036de" -> "bdff4806ebfbaed7b9443105bb234a7a"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e44ba4ae11f1b0036666fa196f7457a2" -> "d66121f23218cffc0d438c5797dee73c"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "2bab5d2d5c56d95acd6994eaf911298a" -> "de00735e4b5e9bfc3dd2b50e7147c53c"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "eb8861dc58c1cb92a813ae6372c946d1" -> "143594fbb18fb73c078173c948ad4867"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "87bf2566d319e4c24e632007f439086f" -> "4d622df3f4c82e0394f8f60be932bf95"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "1ee9498c8af79680766ecb3a68b69f94" -> "0a729327027367f2f389101167fe105f"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "986312d9f32934ad0d5fdd0f7a44832e" -> "3ecb36b7a5d2ef0242ab4114e0eee10a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2e77c62adedf80d1732c4c0a68c8ade3" -> "1d8f9624fcdd5ce70622878353558c08"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "5d6a7850616c62cc9d4a1a1d64ac8070" -> "0693ceb1e3ce7a9df1aba26f08e6aa00"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "b7a673479f5b4652bbfa420ea296207f" -> "ccbcac58a4a483d2e4afe928bed8dd7a"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "3778fac49358643d89b90d519a77ed65" -> "ce35d595054c022fa617e9d244facb6e"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "354df8a6f2ae07e32d3993395fdf6054" -> "dccc9234b98d8f0979073b0d5fa680a5"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "76ecb3a78304813a0e9e04ad5e9039f9" -> "9d16911531a3da468d6a4701acbf0b4e"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "08300282efebe487d8b58dd13bb88b66" -> "59ccfa5f8cf3b4dcba3365a0e3aff6cc"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "491c6cc713fd3a3f4e3b5f79d7f5e569" -> "079f49c2e328b0adf1b2db4bd0097912"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "5cbe05e60b57c567698fa202a943e76e" -> "b2ae6987f360f7feaf339e5d25a2fd06"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c128c4847ce0bc58e9f79e92e07e5212" -> "1a2f482b9161871c04d26ec40964d462"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "7e4c5b2242d96f44d2257dd9e69a866d" -> "90caa7deb98c292aec14d95b0c5762e7"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "7784a8ce1318d390fc420168c3a44821" -> "8bdf8234b5dc6ea5e54d6bb1b2320c4d"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "5e9accdfb294d4495c74187a4a15a4b3" -> "c0f4bc3ecb962f8af774ce08bc70e91e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2cd6ed72536462417dea6f9c81ba497c" -> "d595aae94001f32b3503532bfa49ed17"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1fb429dc87f27d7dac4310350e2cc8af" -> "4b3e63d9d2ea956585c196f2ef1aee7a"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0bcb593d4f484e6cbd10e9e3a94c6196" -> "2849c828c34883ee77ecf5fd2c378b8d"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8e26774a91b5f09ed38bbc62737c241" -> "e16063a67f498e9379d1972d469bb72b"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "870f2cfb0e5dbdefbe91ac2ad5d0c318" -> "6a8889407e5eec9db16a90f01392d494"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "9bd61dc2c806314f06caa02dea88a387" -> "30b3421eee61603a7e79d4f2499e16db"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "113a63c1fed40120c45967254d6d7f44" -> "1122b113b58893223a457b787eaa1eef"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "246f57882b1694bbb531b7ccc903911a" -> "b3b76336e75738f1d4b0a48cbe53958a"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "7761f2d55e143a17974de33561ad13cf" -> "2198daf99ee7e55a225b3899373f24cc"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "79e5c40fb183d362500a357f06241256" -> "691dd0978ee67e7da5e0508992ebabda"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "fb61efccea6e454d076b4d5616d99fff" -> "a830c0e64200195bba1d7604d52e1568"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "vQjV3miEiSxKt1au1FAjOl2qhJegnxngh9POhIlPXAs=" -> "hrZFjjwUVqCzxiJrbsZ/l+Rb76VmNTFCkRn4Y3qItQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "+du9BtoQr++9bI0fjg9LKvdOQ5rNAZ0QLA9qdz9G3j8=" -> "qbe4ESEXwOh+BxcdLsk09iEmpACepk1e//jgpff1iy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "6LvvZocueXIWbSKK2SZAlmPJU82oF6bwJOSwZsmhw9w=" -> "DakbkBSgKlqBl9n+oTLg31VN4CFubhSbzuj6x7he7xM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "y0Pf/ZQkfl6CQQJfcAbAa9IQflsSA1/fnMaM3QECsSY=" -> "ba0IZfz3sHQtLuLEeFfcXnefDFGtBLviMGqiOkgi0mU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "OAxx1IEz1S/mh3kQsNDWigX0GwhCgq9Ltuk++zPPOcI=" -> "NdkY39tmDka6N1PGnUfWPLetI5rflbVwDNbm/IrSjJE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "5r+sk5M+GZYPqdTa34/Yr6vqr8O8R2dY8ChMXQD7dss=" -> "3skBTYx+Pdf6FXsJWIzsUTOuATDY8iGawz3DNtLlqZY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xGgCJZTTC7sGQJHfmiVrRYniA/lEwQjfwupO8P/4zHE=" -> "Qsafu6LWMd9ECF7PhauYjAZpXfdFSiH5kBJH7dP3dFU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Z/rZgEIYL9J/PELwAxQl+luNe0kGYBcKSSF0KJkm/Q=" -> "FYND+ZPZM9Sptt01E4ebeu0HB/EDsRUF4T5//ViCJEM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:15:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "tJipGbrvmggwkNz0r5nWmhAErhun7DzYAyhhXmMOGZc=" -> "z83wEBRn37pwhU9fCbf0egzr0peHWOIfFqlUuqBn/TA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ncoBHY4Fwn5WNOa4D+9liWwJLlNiHVMzqHcHsJ7N7JU=" -> "4JZSjWyBr6rFJD3b8l8v+teafrWITAs/rm7RRTgRCkM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlDYHKVVnOnNNroEB64Md+oUBRNM4PCrMdf+eNoaRIo=" -> "FF9sCBEgnWgDPSwMUZ0WdyZAulB+ArQWtPBLwmebD20="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "dGL8f71LvK1CFzZim9D+uaGf6+TeIQHSvb8Sr1QGk4k=" -> "rMZFQv8L5yAhRYcJ+PzeJuMsb8dll7Dx3Wc6dLzpNXk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "hgF1c1oML+8x6HXbNLrGRpHUS7ihWATgGGdfaZ2xce8=" -> "opiQjPQ9gXDgCs42GlqVmsK/WKC2cfTt7ezL0gYz9ao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "7c11mxPr7jWrk9c0XK+XwjIMhTaDWAUFLAndt3JfwPM=" -> "MP3cLkbHyKZfKY1rg1NpnxubuOUm+HEB8Q2CR6AFg8c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "fm8dRGBZfcsP9pmlnGFArj1f8D/xa95Ullzwszk5SWw=" -> "B5Z6Ez/7XxQvefzGYlYeDXHtu2YkOodB96Q7Hi7BSRw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "nVK927GqGiYQ8zg7l/9JiCZjzkKzQuhsSrDmwRmaEzs=" -> "kMFzsp1yurOcQzkG/8/3C8EqwzJshiuHIl08hb7A1eg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "fKX8HLYMCE9RFB66xVIIQyR2+v18Vz0mX+0NkoT+1Ls=" -> "Cf9u6iEN766alfC6IKIMn5jzgZb9EvvYZrvXSSdq7nU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "E5Nd8cjj3Vyf6nOwsazQ7ROlaaRpUGvjn57RFBpGWgk=" -> "+uGQdzkTV1VX1lYwRdOprwRfCkDPaB6ZhC8/AtYp3B8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "a1Aeig1tSiG79m2vJqi7QqBm5tQBipAn67FyV5lPN2s=" -> "i8AYIg6kvhzOH83+w/SQkmMbUkOqZhjiL0Jw3HHbNHw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "wNH0fFag4SRVKl4kpRqnu0CRj6NpmUHZtzjmvTrlkgE=" -> "kctOXU4ZbMUsx6w9+Vey9sZl+1KEM0beQ02T8xHsRp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "rwXpQbtuAOhuOgS8Ew1VzN5kmIElr27HS7JFHETWr98=" -> "HjmHh2LqWL731CSidZl5SPEEIKCTJ6P50ttGGJJ8qW8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "KdVvkK/K/oNs7iNexfBnucpXLjOOIjcLIhf4rnRFXlA=" -> "USB2plg6FQsC1Owzhh/1/gi3h6mGI/3BNRhBBO/rqEM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "YUMESgSdkAamqWFJ695vrjWT3aZbJKkgYCxtZGo3pSM=" -> "p3Ve7JaBfFcQCK4S6gFgpbIxSb8TkSuV6An+eiCXaQw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "4Uuc26p5Ua0tQ+oa68SpC8GBGKHh0vW6PJxrfmFlsbk=" -> "ruUQXKGQ+PRG1pcHOcfIf3tGcR1hMghJ/r1KrjgrS/Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W23oeV51AgM40bRWLG3FZslJpRQYv9ID3zxjYaKxTA=" -> "vZ4yj7XvJIKBcaDx81n5uM2xj6LdLxHSu0+SApBse3Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "V+pWDdXHx+GFVCZ9+93NlFzRdBZPTJJs/aJI/PS8xD0=" -> "4YqVJCeTOyViwdZqtXdx5yVCU07ojxInDTUrr/kojpA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "25NONkmjsYIs0lAoSMIePDbODnWP85t+ZwAsc7eTxkw=" -> "2NxeKJfvi53mYMv4TOD7rWluw2Z4UvZfaEGjaFCRZUg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "5QzhyBsyArTRK6fXa6VuljbawEhn//kKdPdJeV7d204=" -> "6QvQqGQGWTrY4YvKx9V+M6weUSfQLtsIsOgU1y7wXkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "qQvzDx8TC/tO5m0R77OWwdBEzSBswmzjaCoLwnQRcq0=" -> "jUTFgC7q4nTdem3bVwbBa1ePz8NvTK/1Y+Uy2x2cAZI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "3VHsJo57zefZi5eSt2jGXC6FmKimMSCi8tLcb1gh0iY=" -> "hBTSMf2D+F2dGZfFxpg031nN43D4SI/OvICzdJNFxok="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "EwbbTTqcel++N1LQcqIG5gm8MqL6KC5o2ERk/2TFJ8Y=" -> "sgnx09LrJQdDnRyUD/tIdLajVAjUruGqDxjKP/FWsr4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "3qQeqGv25s5Q5joyMcr2s+GfHOzv/hRwjf8OAGDDTtg=" -> "S6sftrUSc/XdFYF7h6qxI92lRRUk3ENkQtnzdI2XEbc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ke9YIPF+M4/5M3YvfuIWX4URDfo0IK4nukDzU0PhfAA=" -> "CkrM+6kavskJq3JWdlrX/nfEUED4LoIFkGtYP8ivttE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDB5OqNWLMT+luMR3mg4q/PxlIl9ZnKP5QNOQa1t20w=" -> "g4P4OnuOaLAXPM9ywsgVeqT4Cl3ZZHXqaHDaFhFEeQ4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "oMrnbQYRpfRsvOMI9x/1+q4YX19SMLbxwQhx0dK9b8Y=" -> "QHDIYlzMwZBCvI1X7G7Xqg/ovs1X8zav9afSJqH4NaY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "FIAPBZNekYqw90fsGTWceNSh0jjdDkKIPvlVxhsYGn8=" -> "pwzPIkmVyswcGiFsWu/v3xW2nRnmz8dg7UDWPz9isvg="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "dJG6p2oM7OuymOe+PcvZ/DWDS8afuvKpfKVaR9uuudc=" -> "oz0fHbYd+yqNNHDKPwDqSbtf3CZI+oHE0jR/zoL1/P4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "bjQr7ef2Uh4nojOSyOfO/UlSDsFGUzVuNpaoZANG2Ac=" -> "YnPVFhLeyvhQr8US/DRF37n+BLZ9uGwVbzcZJ4EnHuU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "9uOPy0M48qikSpxXbxsIy+MO4qHb7mVsDhBIGjqq5yU=" -> "KMqSy7033zKHoSElKxgZAuJ2P27L2tZYyAKSWv8PvNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "LLbXKUnhCmE2596TkRIZXmro/UGy5pMT0O+rHEFLxBI=" -> "snoy3/ed0PDp7jc8y+7cOHiAN3PtN8ZeQX/et4Pg2ng="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0inBNH7plKcWz2gy6wIdN6XOMQl7blFTQVo8i8I+ks=" -> "qMbc8VLsztnx4SBldp2cfrw+Yon8mt136TmfV9xd3TQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "S781DeSkUnA93CrnkhOfeF/ufi4Id3cR1efLiMURZTY=" -> "Bo9pFTohGwJqfsFqFDGDvJ33Lz6WW4zhKioOgmz4vCg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DShmEgmzMI9CaLUBjJIxu47uDlMTm4g+jYysAippq8I=" -> "Q7SxaUOoFMRJ8xklquk5qpeSD1NyZ6Z//VBsj9v3KbQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ly/bcaTeb6X4kPxrwUSqMN+xORie+KVLoNieP4lWZzs=" -> "y/XE4Y2d+lUjDCwH6rJXCDaeQk1C/SQ/O4I7j40Q04g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-23T17:15:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "8p3hvm" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-23T17:15:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-23T17:15:55Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*